In [1]:
!pip install pandas
!pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in c:\programdata\anaconda3\lib\site-packages (2.3.5)

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('mall_customers_data.csv')

In [4]:
df.head()

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Age Group,Estimated Savings (k$),Credit Score,Loyalty Years,Preferred Category
0,1,Male,19,15,39,18-25,11.10,456,3,Budget
1,2,Male,21,15,81,18-25,6.90,300,6,Luxury
2,3,Female,20,16,6,18-25,15.36,594,2,Budget
3,4,Female,23,16,77,18-25,7.79,300,6,Luxury
4,5,Female,31,17,40,26-35,12.47,480,5,Budget

In [5]:
df

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Age Group,Estimated Savings (k$),Credit Score,Loyalty Years,Preferred Category
0,1,Male,19,15,39,18-25,11.10,456,3,Budget
1,2,Male,21,15,81,18-25,6.90,300,6,Luxury
2,3,Female,20,16,6,18-25,15.36,594,2,Budget
3,4,Female,23,16,77,18-25,7.79,300,6,Luxury
4,5,Female,31,17,40,26-35,12.47,480,5,Budget
...,...,...,...,...,...,...,...,...,...,...
195,196,Female,35,120,79,26-35,56.80,850,7,Luxury
196,197,Female,45,126,28,36-50,102.48,850,5,Electronics
197,198,Male,32,126,74,26-35,63.84,850,6,Luxury
198,199,Male,32,137,18,26-35,120.56,850,4,Fashion
199,200,Male,30,137,83,26-35,61.19,850,7,Luxury

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 10 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
 5   Age Group               196 non-null    object
 6   Estimated Savings (k$)  200 non-null    float64
 7   Credit Score            200 non-null    int64
 8   Loyalty Years           200 non-null    int64
 9   Preferred Category      200 non-null    object
dtypes: float64(1), int64(6), object(3)
memory usage: 15.8+ KB

In [7]:
df.describe()

,CustomerID,Age,Annual Income (k$),Spending Score (1-100),Estimated Savings (k$),Credit Score,Loyalty Years
count,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
mean,100.500000,38.850000,60.560000,50.200000,40.247950,743.680000,5.930000
std,57.879185,13.969007,26.264721,25.823522,21.333448,155.176727,1.570808
min,1.000000,18.000000,15.000000,1.000000,6.460000,300.000000,2.000000
25%,50.750000,28.750000,41.500000,34.750000,28.800000,697.000000,5.000000
50%,100.500000,36.000000,61.500000,50.000000,36.410000,833.000000,6.000000
75%,150.250000,49.000000,78.000000,73.000000,44.967500,850.000000,7.000000
max,200.000000,70.000000,137.000000,99.000000,120.560000,850.000000,9.000000

In [8]:
df.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
Age Group                 4
Estimated Savings (k$)    0
Credit Score              0
Loyalty Years             0
Preferred Category        0
dtype: int64

In [9]:
df['Gender'] = df['Gender'].str.lower()

df['Gender'] = df['Gender'].replace({
    'm': 'male',
    'f': 'female'
})

In [10]:
df

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Age Group,Estimated Savings (k$),Credit Score,Loyalty Years,Preferred Category
0,1,male,19,15,39,18-25,11.10,456,3,Budget
1,2,male,21,15,81,18-25,6.90,300,6,Luxury
2,3,female,20,16,6,18-25,15.36,594,2,Budget
3,4,female,23,16,77,18-25,7.79,300,6,Luxury
4,5,female,31,17,40,26-35,12.47,480,5,Budget
...,...,...,...,...,...,...,...,...,...,...
195,196,female,35,120,79,26-35,56.80,850,7,Luxury
196,197,female,45,126,28,36-50,102.48,850,5,Electronics
197,198,male,32,126,74,26-35,63.84,850,6,Luxury
198,199,male,32,137,18,26-35,120.56,850,4,Fashion
199,200,male,30,137,83,26-35,61.19,850,7,Luxury

In [11]:
df = df.drop_duplicates()

In [14]:

df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')

In [15]:
df

,customerid,gender,age,annual_income_(k$),spending_score_(1-100),age_group,estimated_savings_(k$),credit_score,loyalty_years,preferred_category
0,1,male,19,15,39,18-25,11.10,456,3,Budget
1,2,male,21,15,81,18-25,6.90,300,6,Luxury
2,3,female,20,16,6,18-25,15.36,594,2,Budget
3,4,female,23,16,77,18-25,7.79,300,6,Luxury
4,5,female,31,17,40,26-35,12.47,480,5,Budget
...,...,...,...,...,...,...,...,...,...,...
195,196,female,35,120,79,26-35,56.80,850,7,Luxury
196,197,female,45,126,28,36-50,102.48,850,5,Electronics
197,198,male,32,126,74,26-35,63.84,850,6,Luxury
198,199,male,32,137,18,26-35,120.56,850,4,Fashion
199,200,male,30,137,83,26-35,61.19,850,7,Luxury